hardcoreerik/OrcSDR/apps/orcsdr-c6-bridge/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_1=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESP32P4_TAB5_C6_BOARD=y
CONFIG_ESP_HOSTED_HOST_FEAT_WIFI=y
CONFIG_ESP_HOSTED_HOST_SDIO_TX_Q_SIZE=4
CONFIG_ESP_HOSTED_HOST_SDIO_RX_Q_SIZE=2
CONFIG_ESP_HOSTED_HOST_SDIO_CLK_KHZ=10000
CONFIG_ESP_HOSTED_HOST_SDIO_BUS_WIDTH_4=y
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_HIGH=y
CONFIG_ESP_HOSTED_HOST_RESET_GPIO=15
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_CLK=12
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_CMD=13
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D0=11
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D1=10
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D2=9
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D3=8
CONFIG_ESP_HOSTED_HOST_CP_RESET_STRATEGY_ONLY_IF_NECESSARY=y
CONFIG_ESP_HOSTED_AUTO_CALL_INIT_BEFORE_APP_MAIN=n
